pljakobs/Esp32HardwarePwm/src/Esp32HardwarePwm.cpp
/**
 * @author  Peter Jakobs http://github.com/pljakobs
 */

#include "include/Esp32HardwarePwm.h"
// HW_PWM_DEBUG controls logging for this component only (0=off, 1=errors, 2=+info, 3=full).
// Set via -DHW_PWM_DEBUG=<level> in your Makefile or component.mk (default: 0).
#ifndef HW_PWM_DEBUG
#define HW_PWM_DEBUG 0
#endif
#undef ENABLE_DEBUG
#define ENABLE_DEBUG HW_PWM_DEBUG
#include <debug_progmem.h>
#include <Platform/System.h>
#include <driver/periph_ctrl.h>
#include <esp_err.h>
#include <esp_random.h>
#include <esp_timer.h>
#include <algorithm>
#include <cassert>

/****
 * Sming Framework Project - Open Source framework for high efficiency native ESP8266 development.
 * Created 2015 by Skurydin Alexey
 * http://github.com/SmingHub/Sming
 * All files of the Sming Core are provided under the LGPL v3 license.
 *
 * Esp32HardwarePWM.cpp
 *
 * Esp32 version:   https://github.com/pljakobs
 *
 * This Esp32HardwarePWM library enables Sming framework users to use the ESP32 LEDC PWM API
 * 
 * The ESP32 PWM Hardware is much more powerful than the ESP8266, allowing wider PWM timers (up to 20 bit)
 * as well as much higher PWM frequencies (up to 40MHz for a 1 Bit wide PWM)
 * 
 * Reference: https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/ledc.html
 * 
 * Key Features:
 * - Support for multiple PWM instances with different configurations
 * - Thread-safe operations
 * - Hardware fade support
 * - Phase shifting for EMI reduction
 * - Hardware fading leveraging the ledc_set_fade_and_start 
 * - Per-channel fade queues with FIFO and CYCLIC modes
 * - Automatic splitting of long fades to work around the LEDC step_num ≤ 1023
 * - Per-reload timing compensation to reduce accumulated latency in queued sequences
 * - Application callbacks for fade completion, queue empty, cyclic wrap, and queue errors
 * - Safe teardown with pending callback tracking to prevent use-after-free
 * Note: All LEDC resources are released in the destructor.
 * 
 *
 *
 ****/

// ---------------------------------------------------------------------------
// SOC-specific calibration table (optional — auto-installed by component.mk)
// ---------------------------------------------------------------------------
#ifdef HWPWM_HAS_SOC_CALIB
// The calibration file lives in src/calibration/ (added to include path by
// component.mk when the file is present) and is generated by TimingTest_HwPWM.
//
// component.mk passes -DHWPWM_SOC_CALIB_HEADER='"HwPwmCalib_<soc>.h"' so we
// can #include it directly without relying on token-pasting (which does not
// work for #include filenames on all preprocessors).
#ifndef HWPWM_SOC_CALIB_HEADER
#error "HWPWM_SOC_CALIB_HEADER must be set by component.mk when HWPWM_HAS_SOC_CALIB is defined"
#endif
#include HWPWM_SOC_CALIB_HEADER
#endif

// ---------------------------------------------------------------------------
// Hardware calibration table storage
// ---------------------------------------------------------------------------
static const Esp32HardwarePwm::CalibrationEntry* s_calibTable = nullptr;
static size_t s_calibCount = 0;

void Esp32HardwarePwm::setCalibrationTable(const CalibrationEntry* table, size_t count)
{
	s_calibTable = table;
	s_calibCount = count;
}

#ifdef HWPWM_HAS_SOC_CALIB
// Auto-register the SOC calibration table at program startup via a static
// initialiser so application code needs no changes between RAW and calibrated runs.
namespace
{
struct HwPwmCalibAutoInstall {
	HwPwmCalibAutoInstall()
	{
		Esp32HardwarePwm::setCalibrationTable(HWPWM_CALIB_TABLE, HWPWM_CALIB_COUNT);
	}
} s_hwPwmCalibAutoInstall;
} // namespace
#endif

namespace
{
/**
 * @brief Compute per-reload overhead correction for a given PWM frequency.
 *
 * Empirically the ISR→task dispatch latency scales approximately proportionally
 * with the LEDC timer period rather than being a fixed constant.  Measurements
 * at 1–2 kHz yield actual_overhead ≈ 3 × period, which fits the model that the
 * overhead is dominated by the time the FreeRTOS main task spends waiting for
 * the next LEDC timer edge after System.queueCallback fires (on average 0.5
 * periods) plus task wake-up latency (also a few periods at low clock rates).
 *
 * At higher frequencies (> 4 kHz) the per-step overhead is small relative to
 * the fade step duration, so under-correction is acceptable.
 *
 * Override per channel via setReloadOverheadUs() to calibrate for your
 * specific hardware using the TimingTest_HwPWM sample.
 */
static uint32_t computeReloadOverhead(uint32_t frequency, ledc_timer_bit_t resolution)
{
	if(frequency == 0) {
		return 0;
	}
	// Check hardware-measured calibration table first.
	for(size_t i = 0; i < s_calibCount; ++i) {
		if(s_calibTable[i].frequency == frequency && s_calibTable[i].resolution == resolution) {
			return s_calibTable[i].overheadUs;
		}
	}
	// Formula fallback: fixed dispatch latency + 1 × timer period.
	//
	// After a fade-done ISR the OS task queue dispatches the callback
	// (typically 1300–1700 µs on ESP32 at 240 MHz) and then LEDC waits
	// for the next timer edge before the new fade starts.  Together:
	//   overhead ≈ DISPATCH_LATENCY_US + 1 × period
	//
	// Empirically calibrated from TimingTest_HwPWM.  Install a full
	// calibration table with setCalibrationTable() for tighter accuracy.
	static constexpr uint32_t DISPATCH_LATENCY_US = 1500;
	return DISPATCH_LATENCY_US + (1000000UL / frequency);
}

/**
 * @brief Calculate maximum duty value for given resolution
 */
uint32_t maxDutyForResolution(ledc_timer_bit_t resolution)
{
	return (1U << resolution) - 1;
}

/**
 * @brief Convert frequency to period in microseconds
 */
uint32_t frequencyToPeriod(uint32_t frequency)
{
	return (frequency == 0) ? 0 : (1000000 / frequency);
}

/**
 * @brief Convert period in microseconds to frequency
 */
uint32_t periodToFrequency(uint32_t period_us)
{
	return (period_us == 0) ? 0 : (1000000 / period_us);
}

} // anonymous namespace

// ---------------------------------------------------------------------------
// Steady (zero-range) fade timer callback
// ---------------------------------------------------------------------------

