pljakobs/Esp32HardwarePwm/src/Esp32HardwarePwm.cpp
void Esp32HardwarePwm::steadyFadeTimerCb(void* arg)
{
	auto* ctx = static_cast<SteadyFadeContext*>(arg);
	auto* self = ctx->self;
	uint8_t channel_idx = ctx->channel_idx;
	self->pendingFadeCallbacks_.fetch_or(1u << channel_idx, std::memory_order_relaxed);
	if(!self->fadeCallbackQueued_) {
		self->fadeCallbackQueued_ = true;
		System.queueCallback(Esp32HardwarePwm::dispatchFadeCallbacks, reinterpret_cast<uint32_t>(self));
	}
}

//=============================================================================
// Esp32HardwarePwm Implementation
//=============================================================================

// ---------------------------------------------------------------------------
// Constructors / destructor
// ---------------------------------------------------------------------------

Esp32HardwarePwm::Esp32HardwarePwm(std::vector<uint8_t>& pins, const Config& config) timer_(config.timer),
	spreadSpectrum_(config.spreadSpectrum), phaseShift_(config.phaseShift)
{
	pins_.resize(pins.size());
	fadeQueues_.resize(pins.size());
	for(auto& q : fadeQueues_) {
		q.entries.resize(FADE_QUEUE_DEPTH);
	}
	steadyFadeCtx_.resize(pins.size());
	for(uint8_t i = 0; i < pins.size(); ++i) {
		steadyFadeCtx_[i] = {this, i};
	}
	steadyFadeTimers_.resize(pins.size());
	for(auto& t : steadyFadeTimers_) {
		t = std::make_unique<SimpleTimer>();
	}

	// basic sanity checks
	if(pins.size() == 0) {
		debug_e("Pin count must be positive");
		return;
	}
	if(pins.size() >= SOC_LEDC_CHANNEL_NUM) {
		debug_e("Pin count exceeds available LEDC channels");
		return;
	}
	if(pins.size() + config.channelStart > SOC_LEDC_CHANNEL_NUM) {
		debug_e("Channel range exceeds available channels");
		return;
	}

	/* ---------------------------------------------------------------
	*   populate the pins_ array
    *   gpioPin is assigned the pin passed in the pins array
    *   channel is counted up from config.channelStart
    *   hpoint is handled according to config.phaseShift.mode:
    *       for AUTO, the hpoint is calculated based on the pin index
    *       for MANUAL, the hpoint is taken from the provided manual_hpoints array
    *           if the number of provided hpoints is less than the number of pins, set the remaining hpoints to 0
    *           if the number of provided hpoints is more than the number of pins, the extra hpoints will be ignored
	* --------------------------------------------------------------- */

	for(uint8_t i = 0; i < pins.size(); ++i) {
		auto& cfg = pins_[i];
		cfg.gpioPin = pins[i];
		cfg.channel = (ledc_channel_t)(config.channelStart + i);

		switch(phaseShift_.mode) {
		case PhaseShiftMode::AUTO:
			cfg.hpoint = calculateHpoint(i);
			break;
		case PhaseShiftMode::MANUAL:
			cfg.hpoint = (i < config.phaseShift.manual_hpoints.size()) ? config.phaseShift.manual_hpoints[i] : 0;
			break;
		case PhaseShiftMode::OFF:
		default:
			cfg.hpoint = 0;
			break;
		}
	}

	// Increment each time the compensation model changes — lets you confirm
	// which firmware build produced a given test output.
	static constexpr uint8_t COMPENSATION_REVISION =
		7; // ..., 6=always split range>1023+cycle_num warning, 7=warn only once+warn only when 0<cycle_num<20
	debug_i("PWM Constructor Configuration [compensation rev %u]:", COMPENSATION_REVISION);
	debug_i("  Timer: num=%d, resolution=%d, freq=%d, speed_mode=%d, clk_cfg=%d", timer_.timer_num, timer_.resolution,
			timer_.frequency, timer_.speed_mode, timer_.clk_cfg);
	debug_i("  SpreadSpectrum: mode=%d, WidthPercent=%d, Subsampling=%d", spreadSpectrum_.mode,
			spreadSpectrum_.WidthPercent, spreadSpectrum_.Subsampling);
	debug_i("  PhaseShiftMode: %d", static_cast<int>(phaseShift_.mode));
	debug_i("  Channel start: %d", config.channelStart);
	debug_i("  Pins : %i", pins.size());
	for(size_t i = 0; i < pins.size(); ++i) {
		debug_i("    Pin[%i]: %d, hpoint: %d", i, pins[i], pins_[i].hpoint);
	}

	initialized_ = initialize();
}

Esp32HardwarePwm::~Esp32HardwarePwm()
{
	if(initialized_) {
		// Stop all channels FIRST — ledc_stop aborts any in-progress hardware fade,
		// preventing the fade-done ISR from firing after this object is destroyed.
		for(const auto& pin : pins_) {
			if(pin.isActive) {
				ledc_stop(timer_.speed_mode, pin.channel, 0);
			}
		}
	}

	if(fadeInstalled_) {
		ledc_fade_func_uninstall();
	}

	if(spreadSpectrumTimer_ != nullptr) {
		esp_timer_stop(spreadSpectrumTimer_);
		esp_timer_delete(spreadSpectrumTimer_);
		spreadSpectrumTimer_ = nullptr;
	}

	if(initialized_) {
		// Pause the timer before deconfiguring — ledc_timer_del rejects a
		// still-running timer with ESP_ERR_INVALID_STATE.
		ledc_timer_pause(timer_.speed_mode, timer_.timer_num);

		ledc_timer_config_t timer_config = {
			.speed_mode = timer_.speed_mode, .timer_num = timer_.timer_num, .deconfigure = true};
		auto result = ledc_timer_config(&timer_config);
	}
}

// ---------------------------------------------------------------------------
// Timer / global configuration
// ---------------------------------------------------------------------------

bool Esp32HardwarePwm::setFrequency(uint32_t frequency)
{
	if(!initialized_ || pins_.empty()) {
		debug_e("setFrequency: not initialized or no pins");
		return false;
	}

	// Update frequency for the timer used by our channels

	esp_err_t result = ledc_set_freq(timer_.speed_mode, timer_.timer_num, frequency);

	if(result != ESP_OK) {
		debug_e("Failed to set frequency: %s", esp_err_to_name(result));
		return false;
	}

	timer_.frequency = frequency;
	// Recompute per-reload overhead correction for the new frequency
	uint32_t overhead = computeReloadOverhead(frequency, timer_.resolution);
	for(auto& q : fadeQueues_) {
		q.reloadOverheadUs = overhead;
	}
	debug_i("Set frequency to %d Hz (reload overhead now %lu µs)", frequency, (unsigned long)overhead);
	return true;
}

uint32_t Esp32HardwarePwm::getFrequency() const
{
	if(!initialized_) {
		return 0;
	}

	return ledc_get_freq(timer_.speed_mode, timer_.timer_num);
}

bool Esp32HardwarePwm::setPeriod(uint32_t period_us)
{
	uint32_t frequency = periodToFrequency(period_us);
	return setFrequency(frequency);
}

uint32_t Esp32HardwarePwm::getPeriod() const
{
	return frequencyToPeriod(getFrequency());
}

uint32_t Esp32HardwarePwm::getMaxDuty() const
{
	return maxDutyForResolution(timer_.resolution);
}

uint8_t Esp32HardwarePwm::getResolution() const
{
	return static_cast<uint8_t>(timer_.resolution);
}

