pljakobs/Esp32HardwarePwm/src/Esp32HardwarePwm.cpp
void Esp32HardwarePwm::update()
{
	// todo: this does not do anything meaningful
	if(!initialized_) {
		debug_e("Cannot update: PWM not initialized");
		return;
	}

	// Update all channels
	for(const auto& pin : pins_) {
		if(pin.isActive) {
			ledc_update_duty(timer_.speed_mode, pin.channel);
		}
	}
}

void Esp32HardwarePwm::stopAll(bool idle_level)
{
	for(auto& pin : pins_) {
		ledc_stop(timer_.speed_mode, pin.channel, idle_level);
		pin.isActive = false;
	}
}

// ---------------------------------------------------------------------------
// Primary interface — channel-indexed
// ---------------------------------------------------------------------------

bool Esp32HardwarePwm::setDutyChan(uint8_t channel, uint32_t duty, bool update_immediately)
{
	if(!initialized_ || channel >= pins_.size()) {
		debug_e("setDutyChan: not initialized or channel %d out of range", channel);
		return false;
	}

	auto& cfg = pins_[channel];
	if(cfg.currentDuty == duty) {
		debug_d("Duty for channel %d already at %d, no update needed", channel, duty);
		return true; // no change
	}

	uint32_t max_duty = getMaxDuty();
	if(duty > max_duty) {
		debug_w("Duty %d exceeds maximum %d, clamping", duty, max_duty);
		duty = max_duty;
	}

	debug_i("Setting duty for pin %d channel %d: %d", cfg.gpioPin, cfg.channel, duty);
	cfg.currentDuty = duty;
	ledc_set_duty(timer_.speed_mode, cfg.channel, duty);

	if(update_immediately) {
		debug_i("Updating duty for pin %d channel %d", cfg.gpioPin, cfg.channel);
		ledc_update_duty(timer_.speed_mode, cfg.channel);
	} else {
		debug_i("duty for pin %d channel %d will be updated on next update() call");
	}
	return true;
}

uint32_t Esp32HardwarePwm::getDutyChan(uint8_t channel)
{
	if(!initialized_) {
		return 0;
	}
	if(channel >= pins_.size()) {
		return 0;
	}
	return ledc_get_duty(timer_.speed_mode, pins_[channel].channel);
}

bool Esp32HardwarePwm::setPhaseShiftChan(uint8_t channel, uint32_t phase_shift, bool update_immediately)
{
	if(!initialized_ || channel >= pins_.size()) {
		debug_e("setPhaseShiftChan: not initialized or channel %d out of range", channel);
		return false;
	}

	auto& cfg = pins_[channel];
	cfg.hpoint = phase_shift;

	ledc_set_duty_with_hpoint(timer_.speed_mode, cfg.channel, cfg.currentDuty, cfg.hpoint);
	if(update_immediately) {
		ledc_update_duty(timer_.speed_mode, cfg.channel);
	}
	return true;
}

bool Esp32HardwarePwm::enableFade()
{
	if(fadeInstalled_) {
		return true;
	}

	esp_err_t result = ledc_fade_func_install(0);
	if(result == ESP_OK || result == ESP_ERR_INVALID_STATE) {
		fadeInstalled_ = true;
		return true;
	}
	debug_e("Failed to enable fade: %s", esp_err_to_name(result));
	return false;
}

void Esp32HardwarePwm::disableFade()
{
	if(fadeInstalled_) {
		ledc_fade_func_uninstall(); // disable hardware fade
		fadeInstalled_ = false;
		debug_i("Fade functionality disabled");
	}
}

bool Esp32HardwarePwm::fadeHwChan(uint8_t channel_idx, uint32_t target_duty, uint32_t fade_time_ms)
{
	if(!initialized_ || !fadeInstalled_ || channel_idx >= pins_.size()) {
		debug_e("fadeHwChan: not initialized, fade not installed, or channel %d out of range", channel_idx);
		return false;
	}

	uint32_t max_duty = getMaxDuty();
	if(target_duty > max_duty) {
		target_duty = max_duty;
	}

	fadeDone_[channel_idx] = false;
	pins_[channel_idx].targetDuty = target_duty;
	esp_err_t result = ledc_set_fade_time_and_start(timer_.speed_mode, pins_[channel_idx].channel, target_duty,
													fade_time_ms, LEDC_FADE_NO_WAIT);
	if(result != ESP_OK) {
		fadeDone_[channel_idx] = true;
		debug_e("fadeHwChan failed: %s", esp_err_to_name(result));
		return false;
	}
	return true;
}

bool Esp32HardwarePwm::fadeChan(uint8_t channel_idx, uint32_t target_duty, uint32_t fade_time_ms, bool queue)
{
	if(queue) {
		return queueDutyChan(channel_idx, target_duty, fade_time_ms);
	}
	if(channel_idx >= pins_.size()) {
		return false;
	}
	// Remember whether the channel is mid-fade before we clear the queue.
	// queueDutyChan's auto-start only fires when the channel is idle, so if a
	// fade was running we must force-start the new entry ourselves after enqueue.
	bool wasFading = isFadingChan(channel_idx);
	resetQueue(channel_idx);
	bool ok = queueDutyChan(channel_idx, target_duty, fade_time_ms);
	if(ok && wasFading) {
		startNextFade(channel_idx); // preempts in-progress hw fade on this channel only
	}
	return ok;
}

bool Esp32HardwarePwm::isFadingChan(uint8_t channel_idx) const
{
	if(channel_idx >= pins_.size()) {
		debug_e("isFadingChan: channel %d out of range", channel_idx);
		return false;
	}
	return !fadeDone_[channel_idx];
}

// ---------------------------------------------------------------------------
// Legacy interface — GPIO-pin-indexed
// ---------------------------------------------------------------------------

bool Esp32HardwarePwm::start(uint8_t pin)
{
	if(!initialized_) {
		debug_e("start: not initialized");
		return false;
	}
	return true;
	// todo: do something useful
}

bool Esp32HardwarePwm::stop(uint8_t pin, bool idle_level)
{
	if(!initialized_) {
		debug_e("stop: not initialized");
		return false;
	}

	auto pin_config = getPinConfig(pin);
	if(!pin_config) {
		debug_e("Pin %d not found", pin);
		return false;
	}
	esp_err_t result = ledc_stop(timer_.speed_mode, pin_config->channel, idle_level);

	if(result == ESP_OK) {
		pin_config->isActive = false;
		return true;
	}

	debug_e("stop: ledc_stop failed for pin %d: %s", pin, esp_err_to_name(result));
	return false;
}

void Esp32HardwarePwm::startAll()
{
	// todo: do something useful
}

// ---------------------------------------------------------------------------
// Private
// ---------------------------------------------------------------------------

bool Esp32HardwarePwm::initialize()
{
	debug_i("Esp32HardwarePwm::initialize");

	// Enable LEDC peripheral
	periph_module_enable(PERIPH_LEDC_MODULE);

	if(!enableFade()) {
		debug_e("initialize: enableFade failed");
		return false;
	}

	debug_i("initialize timer");
	// initialize the timer
	ledc_timer_config_t timer_config = {.speed_mode = timer_.speed_mode,
										.duty_resolution = timer_.resolution,
										.timer_num = timer_.timer_num,
										.freq_hz = timer_.frequency,
										.clk_cfg = timer_.clk_cfg};

