pljakobs/Esp32HardwarePwm/src/Esp32HardwarePwm.cpp
	auto result = ledc_timer_config(&timer_config);
	if(result != ESP_OK) {
		debug_e("Failed to configure timer: %s", esp_err_to_name(result));
		return false;
	}

	// Allocate channels from resource manager
	debug_i("Esp32HardwarePwm::initialize - getting Channels");

	if(spreadSpectrum_.mode != SpreadSpectrumMode::OFF) {
		// Configure spread spectrum
		debug_i("Configuring spread spectrum");
		setupSpreadSpectrum(timer_.frequency, spreadSpectrum_);
	}

	// Configure each channel
	for(size_t i = 0; i < pins_.size(); ++i) {
		auto& cfg = pins_[i];
		ledc_channel_config_t channel_config = {.gpio_num = cfg.gpioPin,
												.speed_mode = timer_.speed_mode,
												.channel = cfg.channel,
												.intr_type = LEDC_INTR_DISABLE,
												.timer_sel = timer_.timer_num,
												.duty = 0,
												.hpoint = cfg.hpoint};
		debug_i("Channel config: gpio_num=%d, speed_mode=%d, channel=%d, timer_sel=%d, duty=%d, hpoint=%d",
				channel_config.gpio_num, channel_config.speed_mode, channel_config.channel, channel_config.timer_sel,
				channel_config.duty, channel_config.hpoint);

		auto result = ledc_channel_config(&channel_config);
		if(result != ESP_OK) {
			debug_e("Failed to configure pin %d: %s", channel_config.gpio_num, esp_err_to_name(result));
			return false;
		}

		cfg.isActive = true;

		debug_i("configured pin %d:\n  channel: %d\n  hpoint: %d", cfg.gpioPin, cfg.channel, cfg.hpoint);

		ledc_cbs_t cbs = {.fade_cb = &Esp32HardwarePwm::fadeDoneCallback};
		ledc_cb_register(timer_.speed_mode, cfg.channel, &cbs, this);
		fadeDone_[i] = true;
	}

	debug_i("Initialized PWM with %d pins", pins_.size());

	// Auto-compute per-reload correction for all fade queues
	uint32_t overhead = computeReloadOverhead(timer_.frequency, timer_.resolution);
	for(auto& q : fadeQueues_) {
		q.reloadOverheadUs = overhead;
	}
	debug_i("Reload overhead correction: %lu µs/step (1500 µs dispatch + 1 × period=%lu µs)", (unsigned long)overhead,
			(unsigned long)(1000000UL / timer_.frequency));

	return true;
}

bool Esp32HardwarePwm::setupSpreadSpectrum(int frequency, SpreadSpectrumConfig& config)
{
	spreadSpectrum_ = config;
	int interval_us = 1000000 * spreadSpectrum_.Subsampling / frequency;
	esp_timer_create_args_t timer_args = {.callback = &Esp32HardwarePwm::spreadSpectrumTimerCb,
										  .arg = this,
										  .dispatch_method = ESP_TIMER_TASK,
										  .name = "SpreadSpectrum"};
	esp_timer_handle_t timer_handle = nullptr;
	esp_err_t result = esp_timer_create(&timer_args, &timer_handle);
	if(result != ESP_OK) {
		debug_e("Failed to create timer: %s", esp_err_to_name(result));
		return false;
	}
	esp_timer_start_periodic(timer_handle, interval_us);

	if(!timer_handle) {
		debug_e("Failed to create timer");
		return false;
	}

	spreadSpectrumTimer_ = timer_handle;
	return true;
}

bool IRAM_ATTR Esp32HardwarePwm::fadeDoneCallback(const ledc_cb_param_t* param, void* arg)
{
	auto* self = static_cast<Esp32HardwarePwm*>(arg);
	size_t i = param->channel - self->pins_[0].channel;
	if(i < self->pins_.size()) {
		self->pins_[i].currentDuty = self->pins_[i].targetDuty;
		self->fadeDone_[i] = true;
		self->pendingFadeCallbacks_.fetch_or(1u << i, std::memory_order_relaxed);
		if(!self->fadeCallbackQueued_) {
			self->fadeCallbackQueued_ = true;
			System.queueCallback(dispatchFadeCallbacks, reinterpret_cast<uint32_t>(self));
		}
	}
	return false;
}

void Esp32HardwarePwm::spreadSpectrumTimerCb(void* arg)
{
	static_cast<Esp32HardwarePwm*>(arg)->handleSpreadSpectrum();
}

void Esp32HardwarePwm::handleSpreadSpectrum()
{
	int width = (spreadSpectrum_.WidthPercent * timer_.frequency) / 100;
	int r = esp_random() % (2 * width + 1) - width; // r in [-width, +width]
	ledc_set_freq(timer_.speed_mode, timer_.timer_num, timer_.frequency + r);
}

/* ---------------------------------------------------------------------------
* Fade queue handling
* 
* implemented a per-channel fade queue system to allow sequencing multiple fades 
* with different target values and durations without waiting for each fade to 
* complete before issueing the next one. This is useful for creating complex 
* fade patterns or responding to dynamic changes in desired brightness.
*
* during this work, it became obvious that the timing of led_c fade is not
* precise for all combinations of PWM frequency, bit resolution and fade time.
* also, there latency encured between one fade finishing, the led_c fade-done isr firing
* the Sming event dispatch triggering the callback to enqueue the next fade.
* this library tries to provide compensation for those timing issues by
* - splitting long fades into multiple shorter segments that fit within the 
*   reliable timing range, and automatically chaining them together in the queue 
* - providing approximate compensation for the re-queue latency as measured on 
*   specific hardware. Those compensation values can be calculated for other hardware
*   using the TimingTest_HwPWM sample application and set via setReloadOverheadUs()
* ---------------------------------------------------------------------------
*/

static_assert(SOC_LEDC_CHANNEL_NUM <= 32, "pendingFadeCallbacks_ bitmask too narrow for this SoC");

void Esp32HardwarePwm::dispatchFadeCallbacks(uint32_t param)
{
	auto* self = reinterpret_cast<Esp32HardwarePwm*>(param);
	self->fadeCallbackQueued_ = false;

	// Atomically snapshot-and-clear: any ISR firing between the load and the
	// clear would be lost with two separate operations.
	uint32_t pending = self->pendingFadeCallbacks_.exchange(0, std::memory_order_acq_rel);

	for(uint8_t i = 0; i < self->pins_.size(); ++i) {
		if(!(pending & (1u << i))) {
			continue;
		}

		// If an intermediate split-fade segment just finished, start the next one
		// (already in the queue) without surfacing any callbacks — the application
		// only sees the overall fade completing when the final segment finishes.
		if(self->fadeQueues_[i].activeIsIntermediate) {
			self->startNextFade(i);
			continue;
		}

		if(self->onFadeDone_) {
			self->onFadeDone_(i);
		}

		bool more = self->startNextFade(i);
		if(!more && self->onQueueEmpty_)
			self->onQueueEmpty_(i);
	}
}

Esp32HardwarePwm::FadeEntry Esp32HardwarePwm::dequeueFifo(ChannelFadeQueue& q)
{
	FadeEntry entry = q.entries[q.head];
	q.head = (q.head + 1) % (uint16_t)q.entries.size();
	--q.count;
	return entry;
}

bool Esp32HardwarePwm::startNextFade(uint8_t channel_idx)
{
	if(channel_idx >= pins_.size()) {
		return false;
	}

	ChannelFadeQueue& q = fadeQueues_[channel_idx];

	// Helper: apply all per-step corrections to entry.fadeTimeMs and return it.
	// Called for both FIFO and CYCLIC paths with the dequeued/peeked entry.
	//
	// Two independent carry accumulators run here:
	//
	// 1. Reload overhead correction (carryUs):
	//    Every fade reload adds a fixed per-step latency (ISR→task dispatch +
	//    LEDC edge-alignment wait ≈ 3 × timer period).  We deduct this from
	//    successive fade durations so the total sequence time converges to the
	//    commanded total.
	//
	// 2. cycle_num truncation correction (quantCarryUs):
	//    LEDC computes cycle_num = floor(freq × t_ms / (1000 × range)).  The
	//    fractional part is lost each step.  We compute the exact undershoot:
	//      t_actual_us = cycle_num × range × 1_000_000 / freq
	//      undershoot  = t_requested_us − t_actual_us   (always ≥ 0)
	//    The undershoot is accumulated; when it totals ≥ one extra cycle worth
	//    of time (step_period_us = range × 1_000_000 / freq) we add exactly
	//    one timer cycle's worth of milliseconds to the next step, keeping the
	//    total duration accurate to ±1 cycle over an arbitrarily long queue.
	//    When range == 0 (no-op fade) quantization is zero, carry is unchanged.
	auto applyCorrections = [&](FadeEntry& entry) {
		const uint32_t freq = timer_.frequency;
		const uint32_t range = (entry.targetDuty >= pins_[channel_idx].targetDuty)
								   ? (entry.targetDuty - pins_[channel_idx].targetDuty)
								   : (pins_[channel_idx].targetDuty - entry.targetDuty);

		// --- 2. Quantization carry ---
		// cycle_num = floor(freq × t_ms / (1000 × range)) is the number of PWM
		// periods LEDC spends on each duty step.  The fractional part is lost:
		//   undershoot = t_ms×1000 − cycle_num×range×1_000_000/freq  (µs, ≥ 0)
		// We accumulate this across steps and, once ≥ one extra LEDC cycle,
		// extend the next step so that the total sequence duration converges.
		//
		// Guard: when cycle_num == 0 the requested time is below the hardware
		// minimum (LEDC would clamp to 1 cycle giving actual > requested).
		// That is not a truncation artefact we can fix with carry, so skip.
		//
		// Additionally, the correction unit is "one extra LEDC cycle" =
		//   extra_cycle_us = range × 1_000_000/freq  µs.
		// When range is large and freq is low this can be hundreds of
		// milliseconds — larger than the fade itself.  Applying carry in that
		// regime produces multi-ms jumps every N cycles (very visible glitches).
		// Only accumulate when the unit is ≤ 5 ms, where corrections are fine-
		// grained enough to be useful and safe.
		static constexpr uint32_t MAX_QUANT_UNIT_US = 5000; // 5 ms
		if(freq > 0 && range > 0) {
			uint64_t cycle_num = (freq * (uint64_t)entry.fadeTimeMs) / (1000ULL * range);
			// One extra LEDC cycle = range × 1_000_000/freq µs.
			uint32_t extra_cycle_us = (uint32_t)(((uint64_t)range * 1000000ULL) / freq);
			if(cycle_num > 0 && extra_cycle_us > 0 && extra_cycle_us <= MAX_QUANT_UNIT_US) {
				uint64_t t_us = (uint64_t)entry.fadeTimeMs * 1000ULL;
				uint64_t t_actual_us = (cycle_num * (uint64_t)range * 1000000ULL) / freq;
				int32_t undershoot = (int32_t)(t_us - t_actual_us); // µs, ≥ 0
				q.quantCarryUs += undershoot;

				while(q.quantCarryUs >= (int32_t)extra_cycle_us) {
					q.quantCarryUs -= (int32_t)extra_cycle_us;
					uint32_t addMs = extra_cycle_us / 1000;
					entry.fadeTimeMs += (addMs > 0) ? addMs : 1;
				}
			}
		}

		// --- 1. Reload overhead correction ---
		if(q.reloadOverheadUs > 0) {
			q.carryUs += (int32_t)q.reloadOverheadUs;
			int32_t deductMs = q.carryUs / 1000;
			q.carryUs %= 1000;
			if(entry.fadeTimeMs > (uint32_t)deductMs + 1) {
				entry.fadeTimeMs -= (uint32_t)deductMs;
			} else {
				entry.fadeTimeMs = 1;
			}
		}
	};

	// Zero-range guard: if target == current duty, LEDC cannot execute a hardware fade.
	// Handle by firing the callback immediately (fadeTimeMs==0) or via a SimpleTimer.
	auto handleZeroRangeFade = [&](FadeEntry& entry) -> bool {
		applyCorrections(entry);
		if(entry.targetDuty != pins_[channel_idx].targetDuty) {
			return false;
		}
		// Mark channel as "fading" so isFadingChan() returns true for the
		// duration of the steady-hold.  Without this a caller can re-enter
		// fadeChan before the timer fires, corrupt the
		// queue, and lose the pending callback.
		fadeDone_[channel_idx] = false;
		q.activeIsIntermediate = entry.isPartial;
		if(entry.fadeTimeMs == 0) {
			pendingFadeCallbacks_.fetch_or(1u << channel_idx, std::memory_order_relaxed);
			if(!fadeCallbackQueued_) {
				fadeCallbackQueued_ = true;
				System.queueCallback(dispatchFadeCallbacks, reinterpret_cast<uint32_t>(this));
			}
		} else {
			steadyFadeTimers_[channel_idx]
				->initializeMs(entry.fadeTimeMs, steadyFadeTimerCb, &steadyFadeCtx_[channel_idx])
				.startOnce();
		}
		return true;
	};

	if(q.mode == QueueMode::FIFO) {
		if(q.count == 0)
			return false;
		FadeEntry entry = dequeueFifo(q);
		q.activeIsIntermediate = entry.isPartial;
		if(handleZeroRangeFade(entry)) {
			return true;
		}
		return fadeHwChan(channel_idx, entry.targetDuty, entry.fadeTimeMs);
	}

	// CYCLIC
	if(q.cycleLen == 0) {
		return false;
	}
	FadeEntry entry = q.entries[q.head];
	q.activeIsIntermediate = entry.isPartial;
	uint16_t nextHead = (q.head + 1) % q.cycleLen;
	if(nextHead == 0 && onCyclicWrap_) {
		onCyclicWrap_(channel_idx);
	}
	q.head = nextHead;
	if(handleZeroRangeFade(entry)) {
		return true;
	}
	return fadeHwChan(channel_idx, entry.targetDuty, entry.fadeTimeMs);
}

