pljakobs/Esp32HardwarePwm/src/Esp32HardwarePwm.cpp
void Esp32HardwarePwm::setQueueMode(uint8_t channel, QueueMode mode)
{
	if(channel >= pins_.size()) {
		return;
	}
	fadeQueues_[channel].mode = mode;
	// FIFO auto-starts on first entry; CYCLIC waits for an explicit startQueue() call
	fadeQueues_[channel].autoStart = (mode == QueueMode::FIFO);
}

Esp32HardwarePwm::QueueMode Esp32HardwarePwm::getQueueMode(uint8_t channel) const
{
	if(channel >= pins_.size()) {
		return QueueMode::FIFO;
	}
	return fadeQueues_[channel].mode;
}

uint16_t Esp32HardwarePwm::getQueueEntries(uint8_t channel) const
{
	if(channel >= pins_.size()) {
		return 0;
	}
	const ChannelFadeQueue& q = fadeQueues_[channel];
	return (q.mode == QueueMode::FIFO) ? q.count : q.cycleLen;
}

void Esp32HardwarePwm::resetQueue(uint8_t channel)
{
	if(channel >= pins_.size()) {
		return;
	}
	auto& q = fadeQueues_[channel];
	size_t cap = q.entries.size();
	uint32_t overhead = q.reloadOverheadUs; // preserve auto-computed correction
	q = ChannelFadeQueue{};
	q.entries.resize(cap);
	q.reloadOverheadUs = overhead;
}

bool Esp32HardwarePwm::startQueue(uint8_t channel)
{
	if(!initialized_ || !fadeInstalled_ || channel >= pins_.size()) {
		return false;
	}
	if(isFadingChan(channel)) {
		return false;
	}
	const ChannelFadeQueue& q = fadeQueues_[channel];
	if(q.mode == QueueMode::FIFO && q.count == 0) {
		return false;
	}
	if(q.mode == QueueMode::CYCLIC && q.cycleLen == 0) {
		return false;
	}
	return startNextFade(channel);
}

bool Esp32HardwarePwm::setQueueCapacity(uint8_t channel, uint16_t depth)
{
	if(channel >= pins_.size() || depth == 0) {
		return false;
	}
	ChannelFadeQueue& q = fadeQueues_[channel];
	if(q.count > 0 || q.cycleLen > 0) {
		return false; // queue not empty, refuse resize
	}
	q.entries.resize(depth);
	return true;
}

uint16_t Esp32HardwarePwm::getQueueCapacity(uint8_t channel) const
{
	if(channel >= pins_.size()) {
		return 0;
	}
	return (uint16_t)fadeQueues_[channel].entries.size();
}

void Esp32HardwarePwm::setQueueAutoStart(uint8_t channel, bool autoStart)
{
	if(channel >= pins_.size()) {
		return;
	}
	fadeQueues_[channel].autoStart = autoStart;
}

bool Esp32HardwarePwm::getQueueAutoStart(uint8_t channel) const
{
	if(channel >= pins_.size()) {
		return true;
	}
	return fadeQueues_[channel].autoStart;
}

void Esp32HardwarePwm::setReloadOverheadUs(uint8_t channel, uint32_t overheadUs)
{
	if(channel >= pins_.size()) {
		return;
	}
	fadeQueues_[channel].reloadOverheadUs = overheadUs;
	fadeQueues_[channel].carryUs = 0; // reset carry when overhead changes
}

uint32_t Esp32HardwarePwm::getReloadOverheadUs(uint8_t channel) const
{
	if(channel >= pins_.size()) {
		return 0;
	}
	return fadeQueues_[channel].reloadOverheadUs;
}

bool Esp32HardwarePwm::queueDutyChan(uint8_t channel, uint32_t targetDuty, uint32_t fadeTimeMs)
{
	if(!initialized_ || !fadeInstalled_ || channel >= pins_.size()) {
		debug_e("queueDutyChan: not initialized, fade not installed, or channel %d out of range", channel);
		return false;
	}

	ChannelFadeQueue& q = fadeQueues_[channel];
	uint16_t currentCount = (q.mode == QueueMode::FIFO) ? q.count : q.cycleLen;

	if(targetDuty > getMaxDuty()) {
		targetDuty = getMaxDuty();
	}

	// Determine the duty level this entry will start from: the target of the
	// last queued entry, or the channel's current target if the queue is empty.
	uint32_t fromDuty = (currentCount > 0)
							? q.entries[(q.tail == 0 ? (uint16_t)q.entries.size() : q.tail) - 1].targetDuty
							: pins_[channel].targetDuty;

	uint32_t rangeAbs = (targetDuty >= fromDuty) ? (targetDuty - fromDuty) : (fromDuty - targetDuty);

	// -----------------------------------------------------------------------
	// Splitting: why it exists, what it fixes and what it cannot fix
	//
	// The LEDC hardware has a 10-bit step_num field (max 1023).  When the duty
	// range of a fade exceeds 1023 counts, the driver sets scale = ceil(range/1023),
	// meaning the duty advances by `scale` counts per timer cycle instead of 1.
	// Result: up to (scale-1)/scale of all intermediate duty values are skipped.
	// At 12-bit (range=4095), scale=4 — only one in four values is visited.
	// Splitting the fade into ≤1023-step segments keeps scale=1 throughout, so
	// every duty value is reached.  This is purely a WAVEFORM SMOOTHNESS fix.
	//
	// Splitting does NOT fix timing accuracy.  The hardware computes:
	//
	//   cycle_num = floor(freq × fadeTimeMs / (1000 × range))
	//
	// The fractional part is truncated — the fade always ends slightly early.
	// Since t/range is the same for every segment, cycle_num is INVARIANT under
	// proportional splitting (N cancels), so timing error is identical whether
	// the fade is split or not.  Split anyway for waveform quality.
	//
	// The one exception: if cycle_num == 0 (requested duration is shorter than
	// one LEDC timer cycle), LEDC clamps to 1 cycle — the fade runs LONGER than
	// requested.  Each split segment would also have cycle_num == 0 and be
	// clamped individually, making the total much longer.  Refuse to split in
	// that case.
	// -----------------------------------------------------------------------

	// Compute cycle_num for this fade (same value for any proportional sub-segment).
	uint64_t cycle_num = (rangeAbs > 0) ? ((uint64_t)timer_.frequency * fadeTimeMs) / (1000ULL * rangeAbs) : 0;

	// Warn when cycle_num is in the timing-error regime (1 ≤ cycle_num < SPLIT_STEP_QUALITY).
	// In this range the LEDC integer truncation error is large (cycle_num=4 → ~20% short).
	//
	// cycle_num == 0 means scale > 1 (LEDC advances duty by multiple counts per period).
	// Timing is approximately correct in that regime — no warning needed.
	//
	// Only warn once per channel/session to avoid UART latency affecting timing.
	static constexpr uint32_t SPLIT_STEP_QUALITY = 20;
	if(rangeAbs > 0 && cycle_num > 0 && cycle_num < SPLIT_STEP_QUALITY && !q.warnedLowCycleNum) {
		q.warnedLowCycleNum = true;
		uint64_t t_actual_us = (cycle_num * (uint64_t)rangeAbs * 1000000ULL) / timer_.frequency;
		// Minimum frequency needed to reach cycle_num == SPLIT_STEP_QUALITY for this fade:
		//   freq_min = SPLIT_STEP_QUALITY * 1000 * rangeAbs / fadeTimeMs
		uint32_t freq_min = (uint32_t)(((uint64_t)SPLIT_STEP_QUALITY * 1000ULL * rangeAbs) / fadeTimeMs);
		debug_w("queueDutyChan: ch%d cycle_num=%llu (< %lu) — fade may be %lld ms short (hw limit). "
				"Fix: increase fadeTimeMs, lower resolution, or raise frequency to >= %lu Hz",
				channel, (unsigned long long)cycle_num, (unsigned long)SPLIT_STEP_QUALITY,
				(long long)((int64_t)fadeTimeMs - (int64_t)(t_actual_us / 1000)), (unsigned long)freq_min);
	}

	// Split when range > 1023 (scale > 1) AND cycle_num >= 1 (not below hw minimum).
	bool shouldSplit = (rangeAbs > 1023) && (cycle_num >= 1);
	uint16_t nSegs = shouldSplit ? (uint16_t)((rangeAbs + 1022) / 1023) : 1;

	// If the split segments don't all fit, degrade gracefully to a single unsplit
	// entry rather than silently failing.  The hardware will use scale≥2 with some
	// timing error, but the fade will still execute.
	if(nSegs > 1 && currentCount + nSegs > (uint16_t)q.entries.size()) {
		if(currentCount + 1 <= (uint16_t)q.entries.size()) {
			debug_w("queueDutyChan: ch%d split (%d segs) won't fit, falling back to unsplit", channel, nSegs);
			if(onQueueError_) {
				onQueueError_(channel, QueueError::SPLIT_DEGRADED);
			}
			nSegs = 1;
		} else {
			debug_d("queueDutyChan: channel %d queue full (%d entries, need %d slots)", channel, currentCount, nSegs);
			if(onQueueError_) {
				onQueueError_(channel, QueueError::QUEUE_FULL);
			}
			return false;
		}
	} else if(nSegs == 1 && currentCount + 1 > (uint16_t)q.entries.size()) {
		debug_d("queueDutyChan: channel %d queue full", channel);
		if(onQueueError_) {
			onQueueError_(channel, QueueError::QUEUE_FULL);
		}
		return false;
	}

	int64_t totalRange = (int64_t)targetDuty - (int64_t)fromDuty;
	for(uint16_t s = 0; s < nSegs; ++s) {
		uint32_t segEnd = (uint32_t)((int64_t)fromDuty + totalRange * (s + 1) / nSegs);
		uint32_t segStart = (uint32_t)((int64_t)fromDuty + totalRange * s / nSegs);
		uint32_t segRange = (segEnd >= segStart) ? (segEnd - segStart) : (segStart - segEnd);
		uint32_t segTimeMs = (rangeAbs > 0) ? (uint32_t)((uint64_t)fadeTimeMs * segRange / rangeAbs) : 1;
		if(segTimeMs == 0) {
			segTimeMs = 1;
		}
		q.entries[q.tail] = {segEnd, segTimeMs, /*isPartial=*/(s < nSegs - 1)};
		q.tail = (q.tail + 1) % (uint16_t)q.entries.size();
	}

	if(q.mode == QueueMode::FIFO) {
		q.count += nSegs;
	} else {
		q.cycleLen += nSegs;
	}

	// Auto-start: only when the first logical entry is being added and channel is idle
	if(q.autoStart && !isFadingChan(channel) && currentCount == 0) {
		startNextFade(channel);
	}

	return true;
}
